Tekla Open API Reference for Tekla Structures 2025
DrawingObject.NoAttributes Constructor
 Creates a new default no attributes instance.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public NoAttributes()
Public Sub New
See Also
Reference
DrawingObject.NoAttributes Class
DrawingObject.NoAttributes Overload
Tekla.Structures.Drawing Namespace